Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/vehicle_standards/lighting_of_bicycles_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Lighting of bicycles in Ireland
ga: Soilsiú rothar in Éirinn

source: If you wish to use a bicycle on a public road in Ireland, your bicycle must be fitted with certain reflectors and lamps to ensure that other road users will see you
ga: Más mian leat leas a bhaint as rothar ar bhóthar poiblí in Éirinn, ní mór frithchaiteoirí agus lampaí áirithe a bheith feistithe ar do rothar chun is go gcinnteofar go bhfeicfidh úsáideoirí eile an bhóthair tú

source: All bicycles used on public roads are required to comply with the Road Traffic (Lighting of Vehicles) Regulations 1963 as amended
ga: Ní foláir do gach rothar as a mbaintear leas ar bhóithre poiblí in Éirinn na Rialacháin um Thrácht ar Bhóithre (Soilsiú Feithiclí), 1963-2009 (mar atá arna leasú) a chomhlíonadh

source: This law sets down the type of reflectors and lamps that your bicycle must be fitted with and when you must use your bicycle lamps
ga: Leagann an dlí sin síos an cineál frithchaiteoirí agus lampaí nach mór a fheistiú ar do rothar, na trátha nach mór duit leas a bhaint as do lampa rothair iontu

source: Every year in Ireland, many cyclists are hurt, seriously injured or killed as a result of improper lighting on their bicycles
ga: Gortaítear, loitear go trom nó maraítear go leor rothaithe gach uile bhliain in Éirinn de bharr soilsiú míchuí ar a gcuid rothair

source: Rights to demand name and address of cyclists
ga: Ceart na nGardaí a n-ainmneacha agus a seoltaí a fhiafraí de rothaithe

source: Under Section 108 of the Road Traffic Act 1961 as amended, a member of An Garda Síochána (Irish police force) may demand your name, address and date of birth if they suspect you have committed any crime or offence
ga: Faoi Alt 108 den Acht um Thrácht ar Bhóithre, 1961 (mar atá arna leasú) féadfaidh ball den Gharda Síochána (fórsa póilíneachta na hÉireann) d’ainm agus do sheoladh a éileamh má mheasann sé/sí go bhfuil coir nó cion déanta agat

source: They may also demand your name, address and date of birth if they suspect you have been involved in a collision or caused injury to property or someone else
ga: Féadfaidh sé/sí d’ainm, do sheoladh agus do dháta breithe a éileamh freisin má mheasann sé/sí go raibh páirt agat in imbualadh nó go ndearna tú gortú do dhuine eile nó díobháil do mhaoin

source: If you fail to give your name, address or date of birth, or give a false name, address or date of birth, the Garda may retain your bicycle until they are satisfied as to your identity
ga: Mura dtugann tú d’ainm, do sheoladh agus do dháta breithe, nó má thugann tú ainm, seoladh nó dáta breithe bréige, féadfaidh an Garda do rothar a choinneáil go dtí go mbíonn sé/sí sásta cé tú féin

source: All bicycles used on public roads in Ireland must at all times display a rear reflector
ga: Ní mór frithchaiteoir cúil a thaispeáint i gcónaí ar gach rothar a mbaintear leas as ar bhóithre poiblí in Éirinn

source: A rear reflector means a red reflector that can be plainly seen for a distance of 99 meters (325 feet) to the rear when the headlights of a vehicle shine directly on it
ga: Is éard is brí le frithchaiteoir cúil ná frithchaiteoir dearg ar sofheicthe é go ceann fhad 325 troigh ar chúl nuair a bhíonn ceannsoilse feithicle ag lonrú go díreach air

source: The only exception to this rule is on a child's bicycle where that bicycle is used during the daytime
ga: Is é an t-aon eisceacht amháin ar an riail seo ná ar rothar páiste sa chás go mbaintear leas as an rothar sin i gcaitheamh sholas an lae

source: During "lighting-up time", that is, the period beginning half an hour after sunset and ending half an hour before sunrise on the following morning, all cyclists are required to have fitted (and make use of) the following lighting on their bicycles:
ga: I rith "na huaireanta soilsithe", is é sin an tréimhse arna tosú leathuair tar éis luí na gréine agus arna críochnú leathuair roimh éirí na gréine an mhaidin dár gcionn; ní foláir do gach rothaí an soilsiú seo a leanas a bheith feistithe (agus a leas a bhaint as) ar a rothar:

source: A front lamp means a lamp that is fitted to a non-mechanically propelled vehicle showing to the front a white or yellow light that is visible for a reasonable distance
ga: Is éard is brí le lampa tosaigh ná lampa ar feistithe ar fheithicil tiomána neamh-mheicniúla é; agus solas bán nó solas buí ar taispeáint chun tosaigh uaidh, solas ar feiceálach ó fhad réasúnta é

source: A rear lamp is a lamp that is fitted to the rear of your bicycle and when it is lit, showing a red light that is visible for a reasonable distance
ga: Is lampa ar feistithe ar chúl do rothair é lampa cúil, agus nuair a lastar é, ba cheart go mbeadh solas dearg le feiceáil as ar feiceálach ó fhad réasúnta é

source: Under SI 487 of 2009, since 14 December 2009 it is legal to use flashing front and rear lamps
ga: Faoi IR 487 de 2009, ó 14 Nollaig, 2009 bhfuil sé dlíthiúil a úsáid lampaí gealánach os comhair agus cúil

source: Lamps do not need to be lit when stopped in traffic or when a person wheels the bicycle on foot as near as is possible to the left-hand edge of the road
ga: Ní chaitear na lampaí a bheith ar lasadh nuair a bhítear tagtha chun staid i lár tráchta nó nuair a choisíonn duine leis an rothar chomh gar agus is féidir go colbha na láimhe clé den bhóthar

source: Failure to use proper lighting on a bicycle is an offence
ga: Is cion é gan leas a bhaint as soilsiú cuí ar rothar

source: If you are stopped by a member of the Gardai, the Garda may take your name and address, details about your bicycle and the time and date of the offence
ga: Má stadann Garda tú, féadann an Garda sin d'ainm agus do sheoladh, sonraí faoi do rothair, agus am agus dáta an chiona a thabhairt uait

source: You may be given a caution or you may be issued with a summons to appear in court
ga: Féadtar foláireamh a thabhairt duit nó féadtar toghairm chun teacht os comhair na cúirte a eisiúint duit

source: If you wish to use your bicycle on a public road in Ireland but are unsure about whether your bicycle conforms to the law, you should contact your nearest Garda station for further advice and information
ga: An chuid is mó rothar a dhíoltar sna siopaí an lá inniu ann; bíonn frithchaiteoirí feistithe orthu cheana féin mar nós caighdeánta
